//*动态规划与贪心
//
//贪心对问题的子问题的最优解
//贪心更简单 
//证明局部最优导向全局最优
//田忌赛马
//最优子结构性质
//问题的整体最优解中包含子问题的最优解
//贪心选择性质
//l 整体的最优解可通过一系列局部最优解达到
//l 每次的选择可依赖以前作出的选择，但不依赖后续选择
//贪心能解部分题



//动态规划
//！状态转移方程
//最长上升子序列
//1递归2用数组转移
//
//                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                         `    