/*
项目大概是这样滴

老有所依
该项目面向中老年群体，专注于中老年的身心健康，（背景）是社会福利机构缺失上的补充，是人口老龄化的迫切需要，是中老年美好生活需求的进一步满足。

从身体上，本项目从日常生活中提供健康的营养食谱，满足中老年人对养生和健康的进一步追求。
另外，本项目对于个人轻度疾病的日常措施做引导，以及对该年龄段的易发重病做介绍以及相应的预防和急救措施。

在心理上，本项目对于当下中老年人生活单调甚至感到空虚的情况做功课，通过提供戏曲、广场舞视频、益智休闲游戏等进一步丰富他们的生活。
更实用得提供通俗易懂的手机使用宝典，作为老年人的手机指南。

更重要的是，信息化的时代，中老年人的生活也不可避免的主动或被动地接受着各种各样的信息。
而他们，特别是在互联网的糖果外衣的包裹下，他们的很难去真正的明辨是非。
他们可能会轻信所谓的保健品、或者冒牌的老中医，买回天价的无用品。
他们可能会误入垃圾软件的陷阱，被骗某某软件可以赚钱，可实则只是成为一个看广告的工具。
他们可能会听信网上的各种谣言，或者很多负能量的假新闻，特别是疫情之下，各种流言蜚语，有时我们自己也很难分辨。
他们可能会遭受电信诈骗，中老年群体也是骗子特别看中的对象。
而我们拿出一个区域专门做辟谣推送，引用官方网站内容，并且推送一些被骗的案例做警示，相信会对中老年人很有帮助。


*/