/*
项目概述
1.3项目研究基础
1项目成员均为西安邮电大学计算机学院学生，具备基本的专业知识，具有良好的洞察力和前瞻性。
学生们个个都激情满满， 充满活力，有很多新思想、新点子。项目成员都有着较高的学习能力和实践能力,在一些比赛中崭露头角。
2、有专业的老师做指导,老师具有丰富的实践经验，并取得良好的工作业绩。(具体获奖)
3、本项目研究的数据以及文献的引用均来自专业官方网站，有着科学的依据。
我们自主采集的数据也做到了全面性、多维性、高效性。数据量足够具有分析价值、数据面足够支撑分析需求。
灵活、快速自定义数据的多种属性和不同类型，从而满足不同的分析目标。
明确采集目的，带着问题搜集信息，使信息采集更高效、更有针对性
1.4项目应用前景
我国已经全面建成小康社会，现在，人们不仅要吃得饱，更应该吃得好。
本项目在这个层面上大有可为。
“民以食为天”，本项目着眼于人们的日常饮食。
针对目前人们普遍不太健康的饮食习惯，通过长期陪护的方式，逐步改善人们的
饮食习惯，通过科学饮食，潜移默化的使人们拥有更加健康的身体，提高人们的幸福感和
获得感。

1.5项目创新性
目前我国人口老龄化严重，而如今不没有一个成熟的项目，针对中老年人的日常饮食。
同时很多疾病发生趋于年轻化。我们通过以日常饮食作滋补强身甚至医疗，研究食物对维持健康及防治疾病的作用，即所谓“医食同源”。

食疗养生法简称“食养”。即利用食物来影响机体各方面的功能，使其获得健康或愈疾防病的一种养生方法。俗话也就是通过吃来对我们的身体进行保养。
食物一方面是为人体提供生长发育和健康生存所需的各种营养素的可食性物质。
另一方面，中医很早就认识到食物不仅能营养，
而且还能疗疾祛病。
如近代医家张锡纯在《医学衷中参西录》中曾指出：食物“病人服之，不但疗病，并可充饥；不但充饥，更可适口，用之对症，病自渐愈，即不对症，亦无他患”。
本项目通过个性化服务，改善人们的饮食习惯，促进健康饮食。为建设健康中国做贡献。


*/