//linux unix  posix标准(mac大多也符合)
//fork  api
//04稳定半年一个
//基本命令
//shell 命令解释器
//
//cat catch 用来显示一个文件
//tab补齐命令，上下历史,history
//
//     /  bin可执行程序
//        boot  启动信息  核心二进制  
//         dev 设备  也是文件
//lib库    media U盘  
//opt空的    var变量
//
//ctrl+c怎么退出的
//
//ls  list ls -a   all  列出隐藏文件 （以.开头）、
//          -l列出详细详细信息
//           目录默认占4096或者4096的整数倍
//文件的权限位   硬链接计数   用户名  用户组   占空间大小   创建时间    文件名
//  root组管理员   最高权限 超级用户
//  读、写、执行 rwx r-- ---（文件的所有者 组内 其他）权限
//  最高一位文件的类型
//  -普通文件   d目录 l符号链接（快捷方式） b 块设备文件（U盘磁盘）
//  c字符设备文件（鼠标键盘） s socket 网络 p 管道
//
//  
//
//
//
//
//          -R(大)所有目录的子目录
//          -la    一起执行            
/*pwd 用来显示当前的路径在哪(绝对路径)
    vi 打开文件 vim自动加\n
    :q退出 ：wq保存退出

//?    od -tc file查看字符

//? sudo chomd 777 mice
    cd change dir改变目录      cd -返回上一次的目录  cd ~到用户目录
    touch 创建一个文件
    rm 删除一个文件
    mkdir 创建一个空的目录
    etc  home
//!home
gaopeng用户目录

.当前路径
..上一级路径

cd ../../返回上一级的上一级
（除根目录）

目录蓝色  可执行程序绿色  压缩包红色





*/
